app/views/pools/_standings.html.haml

SELECT "teams".* FROM "teams" INNER JOIN "teams_users" ON "teams"."id" = "teams_users"."team_id" WHERE "teams_users"."user_id" = ?  [["user_id", 16]]
---
          %ul
            - user.teams.sort_by{|x| x.send(@pool.sort_stat)}.reverse.each do |t|