app/views/pools/show.html.haml

                %ul
                  - user.teams.each do |t|
---
SELECT "teams".* FROM "teams" INNER JOIN "teams_users" ON "teams"."id" = "teams_users"."team_id" WHERE "teams_users"."user_id" = ?  [["user_id", 22]]