app/views/users/index.html.haml

SELECT "teams".* FROM "teams" WHERE "teams"."user_id" IN (1, 2, 3) ORDER BY wins DESC
---
              %td.text-center= user.ties
              %td.text-center= user.teams.map{|x| "#{x.name.split(" ").last} (#{x.wins})"}.join(", ")