app/views/users/show.html.haml

  %tbody
    - @user.teams.each do |team|
---
SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = ? ORDER BY wins DESC  [["user_id", 1]]