app/controllers/pools_controller.rb

  def index
    @pools = Pool.all
---
SELECT "pools".* FROM "pools"

  def show
    @users = @pool.users.includes(:teams).sort_by{|x| [x.sort_stat, x.point_differential, x.name]}.reverse
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (204, 202, 196, 190, 180, 187, 179, 188, 197, 194, 206, 177, 199, 183, 193, 186, 178, 200, 182, 191, 189, 198, 201)
SELECT "users".* FROM "users" WHERE "users"."pool_id" = ?  [["pool_id", 5]]

  def update_standings
    Team.update
    @pool = Pool.find(params[:id])
    @users = @pool.users.includes(:teams).sort_by{|x| [x.sort_stat, x.point_differential, x.name]}.reverse
---
UPDATE "teams" SET "losses" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["losses", 1], ["updated_at", "2017-09-08 21:41:31.813952"], ["id", 178]]
SELECT  "pools".* FROM "pools" WHERE "pools"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (204, 202, 196, 190, 180, 187, 179, 188, 197, 194, 206, 177, 199, 183, 193, 186, 178, 200, 182, 191, 189, 198, 201)
SELECT "users".* FROM "users" WHERE "users"."pool_id" = ?  [["pool_id", 4]]

    def set_pool
      @pool = Pool.find(params[:id])
---
SELECT  "pools".* FROM "pools" WHERE "pools"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]