app/controllers/teams_controller.rb

  def index
    # Team.update
    Team.should_auto_update?
    # @teams = Team.all
    @teams = Team.order(wins: :desc, point_differential: :desc)
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."wins" DESC, "teams"."point_differential" DESC

  def update_standings
    # @teams = Team.all.shuffle
    # @teams = Team.update
    case params[:order].to_sym
    when :update_nfl
      @s = Time.now
      Team.update
---
UPDATE "teams" SET "wins" = ?, "losses" = ?, "points_for" = ?, "points_against" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["wins", 0], ["losses", 0], ["points_for", 0], ["points_against", 0], ["updated_at", "2017-08-31 19:33:14.000512"], ["id", 44]]