app/controllers/teams_controller.rb

SELECT  "teams".* FROM "teams" ORDER BY "teams"."updated_at" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    # Team.update
    # @teams = Team.all
    @teams = Team.all.sort_by{|x| [x.wins, x.point_differential]}.reverse