app/controllers/users_controller.rb

  def index
    @users = User.includes(:teams)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (204, 202, 196, 190, 180, 187, 179, 188, 197, 194, 206, 177, 199, 183, 193, 186, 178, 200, 182, 191, 189, 198, 201, 205, 192, 195, 185, 203, 181, 175, 184, 176)
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Brian"], ["created_at", "2017-08-31 17:10:53.268276"], ["updated_at", "2017-08-31 17:10:53.268276"]]