app/views/layouts/_navigation_links.html.haml

SELECT "pools".* FROM "pools"
---
/ %li#= link_to 'Pool Standings', users_path
- Pool.all.each do |p|